-- Заполнить таблицу Работники
INSERT INTO employee(name, phone, birthday, position_id)
	VALUES
	('Иванов Сергей Петрович', '+7-900-1111-22-33', '01-01-1970', 1),
	('Самойлова Ирина Владимировна', '+7-999-1111-22-33', '02-08-1980', 1),
	('Ахметова Алина Рафаэловна', '+7-911-1111-22-44', '10-09-1985', 2),
	('Иванов Василий Петрович', '+7-900-1111-22-34', '01-01-1970', 2),
	('Семенов Андрей Владимирович', '+7-922-1111-22-55', '11-12-1985', 3),
	('Гареев Марсель Рифович', '+7-933-1111-22-66', '10-08-1982', 3),
	('Ахметов Евгений Дмитриевич', '+7-911-1111-22-45', '05-05-1984', 4),
	('Приходько Екатерина Генадиевна', '+7-955-1111-22-77', '01-01-1971', 4),
	('Шмидт Александр Генрихович', '+7-999-1111-22-88', '01-01-1966', 5)
	;
	

SELECT * FROM employee;

SELECT
	NAME AS ФИО,
	birthday AS день_рождения
FROM employee
ORDER BY 2 DESC;	